app/controllers/identities_controller.rb

	def index
	    @all_users = User::USER_TYPES
	    @selected_users = params[:user_types] || session[:user_types] || {}

	    if @selected_users == {}
	      @selected_users = Hash[@all_users.map {|user| [user, user]}]
	    end

	    if params[:user_types] != session[:user_types]
	      session[:user_types] = @selected_users
	      redirect_to :user_types => @selected_users and return
	    end
    	# @users = User.find_all_by_rank(@selected_users.keys)
	    @users = User.paginate(:page => params[:page], :per_page => 10).find_all_by_rank(@selected_users.keys)
---
SELECT "users".* FROM "users" WHERE "users"."uid" = '1' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."rank" IN ('participant', 'admin') LIMIT 10 OFFSET 0

	def show
		@user = User.find_by_uid(params[:id])
		@identity = Identity.find_by_email(@user.email)
---
SELECT "users".* FROM "users" WHERE "users"."uid" = '1' LIMIT 1
SELECT "identities".* FROM "identities" WHERE "identities"."email" = '1351@citadel.edu' LIMIT 1