app/controllers/sessions_controller.rb

	def create
    	user = User.from_omniauth(env["omniauth.auth"], params[:rank])
		if (session[:user_id].nil?) # => wasn't previously logged in
			session[:user_id] = user.uid  # => session id = newly created user's id
			if (user.rank == "admin")
				redirect_to admins_path, notice: "Signed In!"
			else
				redirect_to root, notice: "Failed attempt to sign in"
			end
		else
			if (User.count == 1)
---
SELECT COUNT(*) FROM "users"