app/controllers/users_controller.rb

	def show
		@user_show_id = current_user.nil? ? "content" : "calendar"
		@user = User.find_by_uid(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."uid" = '1' LIMIT 1

  	def change_password
  		@user = User.find_by_uid(current_user.uid)
---
SELECT "users".* FROM "users" WHERE "users"."uid" = '1' LIMIT 1

	def update

	    @user = User.find_by_uid(params[:id])

	    if !params[:password_digest].nil?
		    user_identity = Identity.find_by_email(@user.email)
		    unencrypted_password = params[:password_digest].to_s
		    unencrypted_password_confirmation = params[:password_digest_confirm].to_s

		    if unencrypted_password == unencrypted_password_confirmation

			    password_digest = BCrypt::Password.create(unencrypted_password)
			    user_identity.password_digest = password_digest;
			    user_identity.save!
			else
				flash[:warning] = "Password and confirmation did not match."
				flash.keep
				return redirect_to change_password_path
			end
		end

	    if !params[:user].nil?
	    	@user.update_attributes!(params[:user].permit(:name, :email, :bio))
	    end
	    if !params[:school].nil?
	    	new_school = School.find_by_name(params[:school])
		if @user.schools.include? new_school
---
SELECT "users".* FROM "users" WHERE "users"."uid" = '1' LIMIT 1
SELECT "identities".* FROM "identities" WHERE "identities"."email" = 'penal1@citadel.edu' LIMIT 1
UPDATE "identities" SET "password_digest" = ?, "updated_at" = ? WHERE "identities"."id" = 1  [["password_digest", "$2a$10$BylNoHFVnNcIrJTvIfRIzu1ZubEbIoQMW1BEe/Yw5cs1O3t6AjKr."], ["updated_at", Mon, 15 Dec 2014 02:40:23 UTC +00:00]]
SELECT 1 AS one FROM "identities" WHERE ("identities"."email" = 'penal1@citadel.edu' AND "identities"."id" != 1) LIMIT 1

	def destroy
		@user = User.find_by_uid(params[:id])
		@user.delete
---
SELECT "users".* FROM "users" WHERE "users"."uid" = '2' LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 2